Revit 2027 API
Wire.HotConductorNum Property
 The hot conductor number. Its default value is zero after created.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int HotConductorNum { get; set; }
Public Property HotConductorNum As Integer
	Get
	Set
public:
property int HotConductorNum {
	int get ();
	void set (int value);
}
member HotConductorNum : int with get, set
Property Value
Int32
See Also
Reference
Wire Class
Autodesk.Revit.DB.Electrical Namespace